DEPARTMENT = 'department'
DEPARTMENT_ID = 'department_id'
COURSE_STUDYING_GROUP = 'course_studying_group'
COURSE_STUDYING_GROUP_ID = 'course_studying_group_id'

# paths
CHROME_BINARY_LOCATION = 'C:/Users/Kamyar/AppData/Local/Google/Chrome SxS/Application/chrome.exe'
DRIVER_PATH = 'C:/Users/Kamyar/Dropbox/PC/Documents/Uni/Sem6/Analysis and Designing System/Katyusha/driver/122/chromedriver.exe'
CAPTCHA_IMAGES_PATH = '/captcha_images/'

DEPARTMENTS = {
    'مهندسي برق': 12,
    'مهندسي راه آهن': 13,
    'رياضي و علوم كامپيوتر': 14,
    'مهندسي صنايع': 15,
    'فيزيك': 16,
    'مهندسي مواد و متالورژي': 17,
    'مهندسي معماري': 18,
    'مهندسي مكانيك': 19,
    'مهندسي شيمي، نفت و گاز': 20,
    'مهندسي عمران': 21,
    'مهندسي كامپيوتر': 22,
    'مركز آموزش الكترونيكي': 24,
    'واحد دماوند': 25,
    'تربيت بدني': 26,
    'معارف اسلامي و ادبيات فارسي': 27,
    'زبان': 28,
    'شيمي': 29,
    'مديريت، اقتصاد و مهندسي پيشرفت': 32,
    'پرديس دانشگاهي علم و صنعت': 34,
    'عمومي': 90,
}

COURSE_STUDYING_GP = {
    'عمومي': 11,
    'واحد آموزش كارشناسي': 11,
    'واحد آموزش كارشناسي/ارشد پيوسته': 11,
    'واحد آموزش تحصيلات تكميلي': 12,
    'مهندسي صنايع': 15,
    'مهندسي كامپيوتر': 22,
    'گروه مهندسي پيشرفت': 32,
    'مهندسي برق': 12,
    'مهندسي راه آهن': 13,
    'رياضي و علوم كامپيوتر': 14,
    'فيزيك': 16,
    'مهندسي مواد و متالورژي': 17,
    'مهندسي معماري': 18,
    'مهندسي مكانيك': 19,
    'مهندسي شيمي، نفت و گاز': 20,
    'مهندسي عمران': 21,
    'مركز آموزش الكترونيكي': 24,
    'واحد دماوند': 25,
    'تربيت بدني': 26,
    'معارف اسلامي': 27,
    'زبان': 28,
    'شيمي': 29,
    'مديريت، اقتصاد و مهندسي پيشرفت': 32,
    'پرديس دانشگاهي علم و صنعت': 34,
}

HEADER = [
    'ترم ارائه درس',
    'کد دانشکده درس',
    'دانشکده درس',
    'کد گروه آموزشی درس',
    'گروه آموزشی درس',
    'شماره و گروه درس',
    'نام درس',
    'کل',
    'ع',
    'ظر فیت',
    'ثبت نام شده',
    'تعداد لیست انتظار',
    'جنس', 'نام استاد',
    'زمان و مکان ارائه',
    'زمان و مکان امتحان',
    'محدودیت اخذ',
    'مخصوص ورودی',
    'دروس اجبار/متضاد',
    'نحوه ارائه درس',
    'دوره درس',
    'امکان حذف اضطراری',
    'امکان اخذ توسط مهمان',
    'توضیحات'
]
