DEPARTMENT = 'department'
DEPARTMENT_ID = 'department_id'
COURSE_STUDYING_GROUP = 'course_studying_group'
COURSE_STUDYING_GROUP_ID = 'course_studying_group_id'

DEPARTMENTS = {
    'مهندسي برق': 12,
    'مهندسي راه آهن': 13,
    'رياضي و علوم كامپيوتر': 14,
    'مهندسي صنايع': 15,
    'فيزيك': 16,
    'مهندسي مواد و متالورژي': 17,
    'مهندسي معماري': 18,
    'مهندسي مكانيك': 19,
    'مهندسي شيمي، نفت و گاز': 20,
    'مهندسي عمران': 21,
    'مهندسي كامپيوتر': 22,
    'واحد دماوند': 23,
    'تربيت بدني': 24,
    'معارف اسلامي': 25,
    'زبان': 26,
    'شيمي': 27,
    'مديريت، اقتصاد و مهندسي پيشرفت': 32,
    'پرديس دانشگاهي علم و صنعت': 34,
    'عمومي': 90,
}

COURSE_STUDYING_GP = {
    'عمومي': 11,
    'واحد آموزش كارشناسي': 11,
    'واحد آموزش تحصيلات تكميلي': 12,
    'مهندسي كامپيوتر': 22,
    'گروه مهندسي پيشرفت': 32,
}
